Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.WidthParameterWarning
This is used to post warning. The "External Diameter" parameter must be set to a strictly positive value.

Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.WidthParameterError
This is used to post error.The "External Diameter" parameter must be set to a strictly positive value.

Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.SecondaryEngagementParameterWarning
This is used to post warning. "Bar Engagement 2" has an incorrect value.

Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.SecondaryEngagementParameterError
This is used to post error. "Bar Engagement 2" has an incorrect value.

Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.NoTypeParamsDefinedWarning
The parameters of the default type have no values.

Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.NoBarSizeWarning
This is used to post warning. At least Bar Size 1 or Bar Size 2 should have a value other than "None".

Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.NoBarSizeError
This is used to post error. At least Bar Size 1 or Bar Size 2 should have another value than "None".

Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.MainEngagementParameterWarning
This is used to post warning. "Bar Engagement 1" has an incorrect value.

Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.MainEngagementParameterError
This is used to post error. "Bar Engagement 1" has an incorrect value.

Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.LengthParameterWarning
This is used to post warning. The "Total Length" parameter must be set to a strictly positive value.

Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.LengthParameterError
This is used to post error. The "Total Length" parameter must be set to a strictly positive value.

Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.EngagementBiggerThanLengthWarning
This is used to post warning. The sum of bar engagements is greater than the total coupler length.

Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.EngagementBiggerThanLengthError
This is used to post error. The sum of bar engagements is greater than the total coupler length.

Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.DistanceBetweenBarsWarning
This is used to post warning. The distance between the connected ends of the bars exceeds 10 bar diameters.

Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.DistanceBetweenBarsError
This is used to post error. The distance between the connected ends of the bars exceeds 10 bar diameters.

Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.DisconnectElements
Disconnect the coupler from the connected bar.

Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.CouplerTypeInvalid
This coupler type does not fit on the selected bar(s). Post error to delete the coupler.

Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.CouplerRequiredRemoveFromGroup
The coupler is invalid in group.

Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.CantKeepConstraintsToBars
The constraints between the coupler and the two connected bars are no longer satisfied. Post error to delete the coupler.

Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures
Failures concerning couplers